{
  "ir_version": "0.1.0",
  "source": "C:/public_html/MX2LM/kuhul/engine3d/examples/dispatch_test.k3d",
  "dialect": "kuhul3d-v3-bootstrap",
  "ops": [
    {
      "op": "command",
      "name": "Pop",
      "args": [
        "main"
      ],
      "raw": "[Pop main]"
    },
    {
      "op": "declare",
      "kind": "Tensor",
      "name": "t0",
      "raw": "Tensor t0 = GeometricTensor(shape:(2,2), phase:0.25\u03c0, symmetry:0.8);"
    },
    {
      "op": "command",
      "name": "Wo",
      "args": [
        "t0"
      ],
      "raw": "[Wo t0]"
    },
    {
      "op": "command",
      "name": "KIMD.add",
      "args": [
        "t0",
        "t0"
      ],
      "raw": "[KIMD.add t0 t0]"
    },
    {
      "op": "command",
      "name": "KIMD.mul",
      "args": [
        "t0",
        "t0"
      ],
      "raw": "[KIMD.mul t0 t0]"
    },
    {
      "op": "command",
      "name": "Sek",
      "args": [
        "\u2295",
        "t0",
        "t0"
      ],
      "raw": "[Sek \u2295 t0 t0]"
    },
    {
      "op": "command",
      "name": "Sek",
      "args": [
        "\u229b",
        "t0",
        "t0"
      ],
      "raw": "[Sek \u229b t0 t0]"
    },
    {
      "op": "command",
      "name": "Sek",
      "args": [
        "\u229c",
        "t0",
        "t0"
      ],
      "raw": "[Sek \u229c t0 t0]"
    },
    {
      "op": "command",
      "name": "Sek",
      "args": [
        "\u2297",
        "t0",
        "t0"
      ],
      "raw": "[Sek \u2297 t0 t0]"
    },
    {
      "op": "command",
      "name": "Xul",
      "args": [],
      "raw": "[Xul]"
    }
  ]
}