{
  "ir_version": "0.1.0",
  "source": "kuhul/engine3d/examples/minimal.k3d",
  "dialect": "kuhul3d-v3-bootstrap",
  "ops": [
    {
      "op": "command",
      "name": "Pop",
      "args": [
        "main"
      ],
      "raw": "[Pop main]"
    },
    {
      "op": "declare",
      "kind": "Tensor",
      "name": "t0",
      "raw": "Tensor t0 = GeometricTensor(shape:(2,2), phase:0.25\u03c0, symmetry:0.8);"
    },
    {
      "op": "declare",
      "kind": "Buffer",
      "name": "b0",
      "raw": "Buffer b0 = GPUBuffer(size:4KB, format:float32, flags:UAV, heap:D3D12_HEAP_TYPE_DEFAULT);"
    },
    {
      "op": "command",
      "name": "Wo",
      "args": [
        "t0"
      ],
      "raw": "[Wo t0]"
    },
    {
      "op": "command",
      "name": "Sek",
      "args": [
        "\u2297",
        "t0",
        "t0"
      ],
      "raw": "[Sek \u2297 t0 t0]"
    },
    {
      "op": "dx12_block",
      "statements": [
        "RootSignature rs0 {",
        "CBV(b0);",
        "SRV(t0);",
        "UAV(u0);",
        "}"
      ]
    },
    {
      "op": "command",
      "name": "Xul",
      "args": [],
      "raw": "[Xul]"
    }
  ]
}